IDEA Open Model
Member1D.HingeEnd Property
 Gets, sets hinge located in the end of element
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public ReferenceElement HingeEnd { get; set; }
Public Property HingeEnd As ReferenceElement
	Get
	Set
public:
property ReferenceElement^ HingeEnd {
	ReferenceElement^ get ();
	void set (ReferenceElement^ value);
}
Property Value
Type: ReferenceElement
See Also
Reference
Member1D Class
IdeaRS.OpenModel.Model Namespace